apps/backend/perf/load-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm up'
    - duration: 60
      arrivalRate: 20
      name: 'Ramp up'
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
  processor: './processor.js'
  payload:
    path: './test-repos.csv'
    fields:
      - 'repoUrl'

scenarios:
  - name: 'Health Check'
    weight: 10
    flow:
      - get:
          url: '/health'
          expect:
            - statusCode: 200

  - name: 'Get Repository Commits'
    weight: 40
    flow:
      - post:
          url: '/api/repositories'
          json:
            repoUrl: '{{ repoUrl }}'
          expect:
            - statusCode: 200
          capture:
            - json: '$.commits'
              as: 'commits'

  - name: 'Get Heatmap Data'
    weight: 30
    flow:
      - get:
          url: '/api/commits/heatmap'
          qs:
            repoUrl: '{{ repoUrl }}'
          expect:
            - statusCode: 200

  - name: 'Full Data Request'
    weight: 20
    flow:
      - post:
          url: '/api/repositories/full-data'
          json:
            repoUrl: '{{ repoUrl }}'
            timePeriod: 'day'
          expect:
            - statusCode: 200
          capture:
            - json: '$.commits'
              as: 'commits'
            - json: '$.heatmapData'
              as: 'heatmap'